{
  "blogs" :[
    {
      "title": "Bursting Media Myth # 1 : All Muslims are terrorist?",
      "date":"January 01 2017",
      "author":"Servant of Allah",
      "imageurl":"/blog/assets/img/1.jpg",
      "description":"Does anybody heard of United Liberation Front of Assam(ULFA),Maoist, LTTE,Lord Salvation Army, Naxalites, Irish Republican Army and many others. These are the terrorist groups who belongs to Christianity, Hinduism and Judaism as well as Buddhism. Yet you don't get to hear from Fox News, CNN or NBC or New York Times. Do yourself a favor by clicking this here and burst the myth and steroetype propagated by the media news corp (crap).",
      "sitelocation":"../allmuslimsarenotterrorist/",
      "isThisBlogEntry":"true"
    },
    {
      "title": "Bursting Media Myth # 2: Islam support terrorism.",
      "date":"January 10 2017",
      "author":"Servant of Allah",
      "imageurl":"/blog/assets/img/2.jpg",
      "description":"Islam never support terrorism even in the least. Holy Quran says \"Whoever kills a soul unless for a soul or for corruption [done] in the land - it is as if he had slain mankind entirely. And whoever saves one - it is as if he had saved mankind entirely.\" Holy Quran 5:30",
      "sitelocation":"../islamagainstterrorism/",
      "isThisBlogEntry":"true"
    },
    {
      "title": "Bursting Media Myth # 3: Jihad means Holy War?",
      "date":"February 20 2017",
      "author":"Servant of Allah",
      "imageurl":"/blog/assets/img/3.jpg",
      "description":"Does anybody know the actual meaning of Jihad? It is not Holy War. Holy War was waged by Fox news and other Mainstream media owners forefather religious crusaders. The real meaning of Jihad is to \"strive or struggle\".",
      "sitelocation":"../misconceptionofjihad/",
      "isThisBlogEntry":"true"
    },
    {
      "title": "Bursting Media Myth # 4: Media(Fake News) Overreport Muslim terrorist to create Islamophobia",
      "date":"August 25 2017",
      "author":"Servant of Allah",
      "imageurl":"/blog/assets/img/4.jpg",
      "description":"Do you believe Mainstream media is fair in reporting the truth to the general public? I wish it is. But it is not the case when it comes to report Non Muslim terrorism such as White supremacist and other terrorist who are not Muslims. Hence creating a false fear called Islamophobia",
      "sitelocation":"../whitenationalist-terrorism-media-underreporting/",
      "isThisBlogEntry":"true"
    },
    {
      "title": "Bursting Media Myth # 5: Islam Is anti-Christ?",
      "date":"March 06 2017",
      "author":"Servant of Allah",
      "imageurl":"/blog/assets/img/5.png",
      "description":"Media always claim that Islam is anti-Christ but the fact is that Islam is actually pro Christ. Islam is the only non Christian faith makes it an article of faith to believe in Jesus Christ(Peace be upon him). No Muslim is a Muslim unless he believes in Jesus Christ(Peace be upon him). Find out more by clicking the \"Learn more\" button",
      "sitelocation":"../islam-is-not-antichrist/",
      "isThisBlogEntry":"true"
    },
    {
      "title": "Bursting Media Myth # 6: Islam subjugate women?",
      "date":"April 14 2017",
      "author":"Servant of Allah",
      "imageurl":"/blog/assets/img/IslamicVeil.jpg",
      "description":"Islam never subjugate woman and it is made to be believed in the eyes of the general public to demonize Islam and Muslims.But the same media exalt Nuns who dressed in the same fashion and dress code. Why this double standards?",
      "sitelocation":"../islam-subjugate-women-myth-reality/",
      "isThisBlogEntry":"true"
    },
    {
      "title": "Top 8 Reason why ISIS is anti-Islamic",
      "date":"July 12 2017",
      "author":"Servant of Allah",
      "imageurl":"/blog/assets/img/QatarTurkeyGasLine_01.png",
      "description":"Everywhere you turn on your TV sets or put on mobile devices to get the latest information in the world, we easily get the news about ISIS which is so called Islamic State of Iraq and Syria. Here on Truth Engine Land we are here to expose the lies spread by the fake news media corporation. Here are the top 8 reason why ISIS is another deception by the Fake News CORP showdown.",
      "sitelocation":"../isis-anti-islamic_middleeast/",
      "isThisBlogEntry":"true"
    },
    {
      "title": "Holy Quran, the ultimate answer for the Athiest and the Darwinism",
      "date":"July 30 2017",
      "author":"Servant of Allah",
      "imageurl":"/blog/assets/img/maxresdefault.jpg",
      "description":"Atheist around the world follow their own set of rules and have own their understanding of science and religion. They believe that there is no god and the universe came into existence without any supreme power.i.e., the universe has no origin. Their religion is Darwinism and unfortunately it is taught in public schools as if it is established scientific fact. It is just a theory and not a scientific fact.",
      "sitelocation":"../holyquran-scientific-refuting-athiest-darwinism/",
      "isThisBlogEntry":"true"
    },
    {
      "title": "Defending the Prophet Muhammad (Peace be upon him)",
      "date":"February 18 2017",
      "author":"Servant of Allah",
      "imageurl":"/blog/assets/img/religious-2262785_1280.jpg",
      "description":"Refuting the allegations made by westerners and the fundamentalist against Prophet Muhammad (Peace be upon him)",
      "sitelocation":"../defendingislam/",
      "isThisBlogEntry":"true"
    },
    {
      "title": "Welcome to Ramadhan 2017 Blog",
      "date":"May 25 2017",
      "author":"Servant of Allah",
      "imageurl":"",
      "description":"We thank Allah Almighty for causing us to reach Ramadhan this year with good health and faith. We will post articles related to Ramadhan which we hope would be beneficial for all the Muslims around the globe.",
      "sitelocation":"../ramadhan2017/blog"
    },
    {
      "title": "Ramadhan 2017 Dua Supplication Series 1",
      "date":"May 27 2017",
      "author":"Servant of Allah",
      "imageurl":"",
      "description":"Supplication is the essence of worship[Tirmidhi]. “And your Lord says, “Call upon Me: I will respond to you.” Indeed, those who disdain My worship will enter Hell [rendered] contemptible.” [40:60].",
      "sitelocation":"../ramadhan2017/"
    },
    {
      "title": "About Us",
      "date":"",
      "author":"Servant of Allah",
      "imageurl":"",
      "description":"",
      "sitelocation":"../about-us/"
    },
    {
      "title": "Contact Us",
      "date":"",
      "author":"Servant of Allah",
      "imageurl":"",
      "description":"",
      "sitelocation":"../contact-us/"
    }
    ]
}
